app/controllers/comments_controller.rb

  def create

    @new_comment = current_user.comments.build(comment_params)
    if @new_comment.save
---
INSERT INTO "comments" ("body", "post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy

    comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 133]]