app/controllers/likes_controller.rb

  def create

    @liker = current_user
    @liked = Post.find(params[:liked_id])
    if @liker.liked_posts << @liked
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 303]]
INSERT INTO "likes" ("liked_type", "liked_id", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liked_type", "Post"], ["liked_id", 303], ["liker_id", 829], ["created_at", "2015-11-11 20:16:04.249218"], ["updated_at", "2015-11-11 20:16:04.249218"]]

  def destroy

    if Like.find(params[:id]).destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 87]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 87]]