app/controllers/posts_controller.rb

  def create

    @new_post = current_user.posts.build(post_params)

    if @new_post.save
---
INSERT INTO "posts" ("author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def set_post_vars(user_id)

    @user = User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 806]]